{"/array-ds":{"title":"array-ds","data":{}},"/array-ds/array-ds01":{"title":"Search, insert and delete in an unsorted array","data":{}},"/array-ds/array-ds03":{"title":"Write a program to reverse an array","data":{}},"/dsa":{"title":"dsa","data":{}},"/array-ds/array-ds02":{"title":"Search, insert and delete in a sorted array","data":{}},"/dsa/dsa01":{"title":"What is Data Structure: Types, Classifications and Applications","data":{}},"/dsa/dsa02":{"title":"Introduction to Data Structures","data":{}},"/dsa/dsa03":{"title":"Common operations on various Data Structures","data":{}},"/link-list-ds":{"title":"link-list-ds","data":{}},"/link-list-ds/circular-link-list":{"title":"circular-link-list","data":{}},"/link-list-ds/circular-link-list/circular-link-list01":{"title":"circular-link-list01","data":{}},"/link-list-ds/circular-link-list/circular-link-list02":{"title":"circular-link-list02","data":{}},"/link-list-ds/circular-link-list/circular-link-list03":{"title":"circular-link-list03","data":{}},"/link-list-ds/doubly-link-list":{"title":"doubly-link-list","data":{}},"/link-list-ds/doubly-link-list/doubly-link-list01":{"title":"doubly-link-list01","data":{}},"/link-list-ds/doubly-link-list/doubly-link-list02":{"title":"doubly-link-list02","data":{}},"/link-list-ds/doubly-link-list/doubly-link-list03":{"title":"doubly-link-list03","data":{}},"/link-list-ds/singly-link-list":{"title":"singly-link-list","data":{}},"/link-list-ds/singly-link-list/singly-link-list01":{"title":"singly-link-list01","data":{}},"/link-list-ds/singly-link-list/singly-link-list02":{"title":"singly-link-list02","data":{}},"/link-list-ds/singly-link-list/singly-link-list03":{"title":"singly-link-list03","data":{}},"/markdown":{"title":"Markdown","data":{"github-flavored-markdown#GitHub Flavored Markdown":"GFM is an extension of Markdown, created by\nGitHub, that adds support for strikethrough, task lists, tables, and more.","strikethrough#Strikethrough":"removed\n~~removed~~","task-list#Task List":"Write the press release\nUpdate the website\nContact the media\n- [x] Write the press release\n- [ ] Update the website\n- [ ] Contact the media","table#Table":"Syntax\tDescription\tTest Text\tHeader\tTitle\tHere's this\tParagraph\tText\tAnd more\tStrikethrough\t\tText\t\n| Syntax        | Description |   Test Text |\n| :------------ | :---------: | ----------: |\n| Header        |    Title    | Here's this |\n| Paragraph     |    Text     |    And more |\n| Strikethrough |             |    ~~Text~~ |","autolinks#Autolinks":"Visit https://nextjs.org.\nVisit https://nextjs.org.","custom-heading-id#Custom Heading Id":"You can specify custom heading id using the format ## My heading [#custom-id].\nFor example:\n## Long heading about Nextra [#about-nextra]\nIn this example, #about-nextra will be used as the heading link, replacing the\ndefault #long-heading-about-nextra.","callout-component#Callout Component":"Space Invaders is a 1978 shoot 'em up arcade game developed by Tomohiro\nNishikado.\nToday is Friday.\nThis API will be deprecated soon.\nThis is a dangerous feature that can cause everything to explode.","tabs-component#Tabs Component":"pnpm: Fast, disk space efficient package manager.\nnpm is a package manager for the JavaScript programming language.\nYarn is a software packaging system.","cards-component#Cards Component":"A built-in component that allows you to display content in a visually appealing card format. It includes options for adding an icon, title, link and an image to related content.这是一个内置组件，可让您以具有视觉吸引力的卡片格式显示内容。它包括为相关内容添加图标、标题、链接和图片的选项。","steps-component#Steps Component":"A built-in component to turn a numbered list into a visual representation of steps.将编号列表转化为可视化步骤表示的内置组件。\nWrap a set of markdown headings with the <Steps> component to turn them into visual steps.\nIt supports <h2>, <h3>, and <h4> headings. You can choose the appropriate heading level based on the content hierarchy on the page.\n用 <Steps> 组件包裹一组标记符标题，将其转化为可视化步骤。它支持 <h2>、<h3> 和 <h4> 标题。您可以根据页面上的内容层次来选择适当的标题级别。","getting-started#Getting Started":"Here is some description.","step-1#Step 1":"Contents for step 1.","step-2#Step 2":"Contents for step 2.\nTo exclude the headings from the <Steps> component (or any other headings) to\nappear in the Table of Contents, replace the Markdown headings ### ... with <h3> HTML element wrapped in curly braces.\n要在目录中排除 <Steps> 组件中的标题（或任何其他标题），请将 Markdown 标题 ## ... 替换为用大括号包裹的 <h3> HTML 元素。\nContents for step 1.Contents for step 2.Contents for step 3.\nA built-in component to visually represent a file tree.","example#Example":"Click the folder to test the dynamic functionality of the file tree.","usage#Usage":"Create the file tree structure by nesting <FileTree.Folder> and\n<FileTree.File> components within a <FileTree>. Name each file or folder\nwith the name attribute. Use defaultOpen to set the folder to open on load.\nimport { FileTree } from 'nextra/components'\n<FileTree>\n  <FileTree.Folder name=\"pages\" defaultOpen>\n    <FileTree.File name=\"_meta.js\" />\n    <FileTree.File name=\"contact.md\" />\n    <FileTree.File name=\"index.mdx\" />\n    <FileTree.Folder name=\"about\">\n      <FileTree.File name=\"_meta.js\" />\n      <FileTree.File name=\"legal.md\" />\n      <FileTree.File name=\"index.mdx\" />\n    </FileTree.Folder>\n  </FileTree.Folder>\n</FileTree>"}},"/":{"title":"Data Structures Tutorial","data":{"":"Data structures are the fundamental building blocks of computer programming. They define how data is organized,\nstored, and manipulated within a program. Understanding data structures is very important for developing efficient and effective algorithms.数据结构是计算机编程的基本构件。它们定义了如何在程序中组织、存储和操作数据。了解数据结构对于开发高效和有效的算法非常重要。In this tutorial, we will explore the most commonly used data structures, including arrays, linked lists, stacks, queues, trees, and graphs.在本教程中，我们将探索最常用的数据结构，包括数组、链表、栈、队列、树和图。\nA data structure is a storage that is used to store and organize data. It is a way of arranging data on a computer so that it can be accessed and updated efficiently.数据结构是一种用于存储和组织数据的存储方式。它是一种在计算机上排列数据的方式，以便可以高效地访问和更新数据。A data structure is not only used for organizing the data. It is also used for processing, retrieving, and storing data. There are different basic and advanced types of data structures that are used in almost every program or software system that has been developed. So we must have good knowledge about data structures.数据结构不仅用于组织数据，还用于处理、检索和存储数据。它还用于处理、检索和存储数据。数据结构有不同的基本类型和高级类型，几乎每个已开发的程序或软件系统都会用到。因此，我们必须充分了解数据结构。\nLinear Data Structure: Data structure in which data elements are arranged sequentially or linearly, where each element is attached to its previous and next adjacent elements, is called a linear data structure.\n线性数据结构： 数据元素按顺序或线性排列的数据结构，其中每个元素都与其上一个和下一个相邻元素相连，称为线性数据结构。\nExample: Array, Stack, Queue, Linked List, etc.\nStatic Data Structure: Static data structure has a fixed memory size. It is easier to access the elements in a static data structure.\n静态数据结构： 静态数据结构具有固定的内存大小。访问静态数据结构中的元素更容易。\nExample: array.\nDynamic Data Structure: In dynamic data structure, the size is not fixed. It can be randomly updated during the runtime which may be considered efficient concerning the memory (space) complexity of the code.\n动态数据结构： 在动态数据结构中，大小并不固定。它可以在运行时随机更新，这在代码的内存（空间）复杂度方面可能被认为是高效的。\nExample: Queue, Stack, etc.\nNon-Linear Data Structure: Data structures where data elements are not placed sequentially or linearly are called non-linear data structures. In a non-linear data structure, we can’t traverse all the elements in a single run only.\n非线性数据结构： 数据元素不按顺序或线性放置的数据结构称为非线性数据结构。在非线性数据结构中，我们无法仅在一次运行中遍历所有元素。\nExamples: Trees and Graphs.\nIntroduction to Data Structures"}}}